# Project Overview

You receive a European Soccer Database that has more than 25,000 matches and more than 10,000 players for European professional soccer seasons from 2008 to 2016. The goal is you walk through this database to do analysis include some steps for exploring our dataset, some steps for basics statistics and then you visualize the result. To complete all your steps, you need to query your data in the database using SQL statement. This project practices you write SQL command to pull data and extrac it.

# Database Description

This European Soccer Database has more than 25,000 matches and more than 10,000 players for European professional soccer seasons from 2008 to 2016, 11 European Countries with their lead championship. Players and Teams' attributes sourced from EA Sports' FIFA video game series, including the weekly updates.

# Import Python package

In [1]:
#Import libraries
import numpy as np
import pandas as pd
import sqlite3
from datetime import timedelta
import warnings
warnings.filterwarnings("ignore")
pd.set_option("display.max_columns", 100)

## Question 1: Connect to database and get information of all tables

Read https://docs.python.org/2/library/sqlite3.html

You write only SQL statement to get the result, should not use Pandas to manipulate result.

In [2]:
#Connect to database 
# establish a new connection with sqlite
conn = sqlite3.connect('database.sqlite')

#and get information of all tables
tables = pd.read_sql("""SELECT *
                        FROM sqlite_master
                        WHERE type='table';""", conn)
print(tables)

    type               name           tbl_name  rootpage  \
0  table    sqlite_sequence    sqlite_sequence         4
1  table  Player_Attributes  Player_Attributes        11
2  table             Player             Player        14
3  table              Match              Match        18
4  table             League             League        24
5  table            Country            Country        26
6  table               Team               Team        29
7  table    Team_Attributes    Team_Attributes         2

                                                 sql
0             CREATE TABLE sqlite_sequence(name,seq)
1  CREATE TABLE "Player_Attributes" (\n\t`id`\tIN...
2  CREATE TABLE `Player` (\n\t`id`\tINTEGER PRIMA...
3  CREATE TABLE `Match` (\n\t`id`\tINTEGER PRIMAR...
4  CREATE TABLE `League` (\n\t`id`\tINTEGER PRIMA...
5  CREATE TABLE `Country` (\n\t`id`\tINTEGER PRIM...
6  CREATE TABLE "Team" (\n\t`id`\tINTEGER PRIMARY...
7  CREATE TABLE `Team_Attributes` (\n\t`id`\tINTE...

## Question 2: Select data in "Country" table

In [3]:
#write your query
countries = pd.read_sql("select * from country", conn)
print(countries)

       id         name
0       1      Belgium
1    1729      England
2    4769       France
3    7809      Germany
4   10257        Italy
5   13274  Netherlands
6   15722       Poland
7   17642     Portugal
8   19694     Scotland
9   21518        Spain
10  24558  Switzerland

## Question 3: Select data in "League" table

In [4]:
#write your query
leagues = pd.read_sql("select * from league", conn)
print(leagues)

       id  country_id                      name
0       1           1    Belgium Jupiler League
1    1729        1729    England Premier League
2    4769        4769            France Ligue 1
3    7809        7809     Germany 1. Bundesliga
4   10257       10257             Italy Serie A
5   13274       13274    Netherlands Eredivisie
6   15722       15722        Poland Ekstraklasa
7   17642       17642  Portugal Liga ZON Sagres
8   19694       19694   Scotland Premier League
9   21518       21518           Spain LIGA BBVA
10  24558       24558  Switzerland Super League

## Question 4: Select League data with country information
The League table has relation with Country table by country_id. Use the join sql statement to join two tables.

In [5]:
#write your query
leagues = pd.read_sql("""
    select l.name as league, c.name as country
    from league as l
    inner join country as c
    on l.country_id = c.id """, conn)
print(leagues)

                      league      country
0     Belgium Jupiler League      Belgium
1     England Premier League      England
2             France Ligue 1       France
3      Germany 1. Bundesliga      Germany
4              Italy Serie A        Italy
5     Netherlands Eredivisie  Netherlands
6         Poland Ekstraklasa       Poland
7   Portugal Liga ZON Sagres     Portugal
8    Scotland Premier League     Scotland
9            Spain LIGA BBVA        Spain
10  Switzerland Super League  Switzerland

## Question 5: Select data from _Match_ table
- When a team is serving as host of a contest, it is designated as the "home team". The opposing team is said to be the "away 
team"
- In Match table, each row is a match with one home team and one away team including home team goal and away team goal respectively

In [6]:
#write your query
matches = pd.read_sql("select * from `match`", conn)
matches

,id,country_id,league_id,season,stage,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,away_team_goal,home_player_X1,home_player_X2,home_player_X3,home_player_X4,home_player_X5,home_player_X6,home_player_X7,home_player_X8,home_player_X9,home_player_X10,home_player_X11,away_player_X1,away_player_X2,away_player_X3,away_player_X4,away_player_X5,away_player_X6,away_player_X7,away_player_X8,away_player_X9,away_player_X10,away_player_X11,home_player_Y1,home_player_Y2,home_player_Y3,home_player_Y4,home_player_Y5,home_player_Y6,home_player_Y7,home_player_Y8,home_player_Y9,home_player_Y10,home_player_Y11,away_player_Y1,away_player_Y2,away_player_Y3,away_player_Y4,away_player_Y5,away_player_Y6,...,home_player_11,away_player_1,away_player_2,away_player_3,away_player_4,away_player_5,away_player_6,away_player_7,away_player_8,away_player_9,away_player_10,away_player_11,goal,shoton,shotoff,foulcommit,card,cross,corner,possession,B365H,B365D,B365A,BWH,BWD,BWA,IWH,IWD,IWA,LBH,LBD,LBA,PSH,PSD,PSA,WHH,WHD,WHA,SJH,SJD,SJA,VCH,VCD,VCA,GBH,GBD,GBA,BSH,BSD,BSA
0,1,1,1,2008/2009,1,2008-08-17 00:00:00,492473,9987,9993,1,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None,None,None,None,None,None,None,None,1.73,3.40,5.00,1.75,3.35,4.20,1.85,3.2,3.5,1.80,3.3,3.75,NaN,NaN,NaN,1.70,3.30,4.33,1.90,3.3,4.00,1.65,3.40,4.50,1.78,3.25,4.00,1.73,3.40,4.20
1,2,1,1,2008/2009,1,2008-08-16 00:00:00,492474,10000,9994,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None,None,None,None,None,None,None,None,1.95,3.20,3.60,1.80,3.30,3.95,1.90,3.2,3.5,1.90,3.2,3.50,NaN,NaN,NaN,1.83,3.30,3.60,1.95,3.3,3.80,2.00,3.25,3.25,1.85,3.25,3.75,1.91,3.25,3.60
2,3,1,1,2008/2009,1,2008-08-16 00:00:00,492475,9984,8635,0,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None,None,None,None,None,None,None,None,2.38,3.30,2.75,2.40,3.30,2.55,2.60,3.1,2.3,2.50,3.2,2.50,NaN,NaN,NaN,2.50,3.25,2.40,2.63,3.3,2.50,2.35,3.25,2.65,2.50,3.20,2.50,2.30,3.20,2.75
3,4,1,1,2008/2009,1,2008-08-17 00:00:00,492476,9991,9998,5,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None,None,None,None,None,None,None,None,1.44,3.75,7.50,1.40,4.00,6.80,1.40,3.9,6.0,1.44,3.6,6.50,NaN,NaN,NaN,1.44,3.75,6.00,1.44,4.0,7.50,1.45,3.75,6.50,1.50,3.75,5.50,1.44,3.75,6.50
4,5,1,1,2008/2009,1,2008-08-16 00:00:00,492477,7947,9985,1,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None,None,None,None,None,None,None,None,5.00,3.50,1.65,5.00,3.50,1.60,4.00,3.3,1.7,4.00,3.4,1.72,NaN,NaN,NaN,4.20,3.40,1.70,4.50,3.5,1.73,4.50,3.40,1.65,4.50,3.50,1.65,4.75,3.30,1.67
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25974,25975,24558,24558,2015/2016,9,2015-09-22 00:00:00,1992091,10190,10191,1,0,1.0,2.0,4.0,6.0,8.0,4.0,6.0,3.0,5.0,7.0,5.0,1.0,2.0,4.0,6.0,8.0,4.0,6.0,3.0,5.0,7.0,5.0,1.0,3.0,3.0,3.0,3.0,6.0,6.0,8.0,8.0,8.0,11.0,1.0,3.0,3.0,3.0,3.0,6.0,...,195215.0,462944.0,563066.0,8800.0,67304.0,158253.0,133126.0,186524.0,93223.0,121115.0,232110.0,289732.0,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25975,25976,24558,24558,2015/2016,9,2015-09-23 00:00:00,1992092,9824,10199,1,2,1.0,3.0,5.0,7.0,2.0,4.0,6.0,8.0,5.0,4.0,6.0,1.0,2.0,4.0,6.0,8.0,3.0,5.0,7.0,3.0,5.0,7.0,1.0,3.0,3.0,3.0,7.0,7.0,7.0,7.0,9.0,11.0,11.0,1.0,3.0,3.0,3.0,3.0,7.0,...,37257.0,42276.0,114792.0,150007.0,178119.0,27232.0,570830.0,260708.0,201704.0,36382.0,34082.0,95257.0,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25976,25977,24558,24558,2015/2016,9,2015-09-23 00:00:00,1992093,9956,10179,2,0,1.0,2.0,4.0,6.0,8.0,4.0,6.0,3.0,5.0,7.0,5.0,1.0,2.0,4.0,6.0,8.0,4.0,6.0,3.0,5.0,7.0,5.0,1.0,3.0,3.0,3.0,3.0,6.0,6.0,8.0,8.0,8.0,11.0,1.0,3.0,3.0,3.0,3.0,6.0,...,289472.0,10637.0,67349.0,202663.0,32597.0,114794.0,188114.0,25840.0,482200.0,95230.0,451335.0,275122.0,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25977,25978,24558,24558,2015/2016,9,2015-09-22 00:00:00,1992094,7896,10243,0,0,1.0,2.0,4.0,6.0,8.0,3.0,7.0,5.0,3.0,5.0,7.0,1.0,2.0,4.0,6.0,8.0,4.0,6.0,3.0,5.0,7.0,5.0,1.0,3.0,3.0,3.0,3.0,7.0,7.0,7.0,10.0,10.0,10.0,1.0,3.0,3.0,3.0,3.0,6.0,...,178142.0,274776.0,121080.0,197757.0,260964.0,231614.0,113235.0,41116.0,462608.0,42262.0,92252.0,194532.0,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25978,25979,24558,24558,2015/2016,9,2015-09-23 00:00:00,1992095,10192,9931,4,3,1.0,2.0,4.0,6.0,8.0,2.0,4.0,6.0,8.0,4.0,6.0,1.0,2.0,4.0,6.0,8.0,4.0,6.0,3.0,5.0,7.0,5.0,1.0,3.0,3.0,3.0,3.0,7.0,7.0,7.0,7.0,10.0,10.0,1.0,3.0,3.0,3.0,3.0,6.0,...,71764.0,156175.0,95216.0,172768.0,22834.0,458806.0,207234.0,25772.0,40274.0,34035.0,41726.0,527103.0,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Question 6: Select match data includes league and country information

The Match table has relation with:
 - Country table by country_id
 - League table by League_id
 
Use the join sql statement to join 3 tables.

In [7]:
# join two tables as below
matches_with_team = pd.read_sql("""
    select m.season, m.date, m.home_team_goal, m.away_team_goal, l.name as league, c.name as country
    from match as m
    inner join league as l on m.league_id = l.id
    inner join country as c on m.country_id = c.id""", conn)

matches_with_team

,season,date,home_team_goal,away_team_goal,league,country
0,2008/2009,2008-08-17 00:00:00,1,1,Belgium Jupiler League,Belgium
1,2008/2009,2008-08-16 00:00:00,0,0,Belgium Jupiler League,Belgium
2,2008/2009,2008-08-16 00:00:00,0,3,Belgium Jupiler League,Belgium
3,2008/2009,2008-08-17 00:00:00,5,0,Belgium Jupiler League,Belgium
4,2008/2009,2008-08-16 00:00:00,1,3,Belgium Jupiler League,Belgium
...,...,...,...,...,...,...
25974,2015/2016,2015-09-22 00:00:00,1,0,Switzerland Super League,Switzerland
25975,2015/2016,2015-09-23 00:00:00,1,2,Switzerland Super League,Switzerland
25976,2015/2016,2015-09-23 00:00:00,2,0,Switzerland Super League,Switzerland
25977,2015/2016,2015-09-22 00:00:00,0,0,Switzerland Super League,Switzerland
25978,2015/2016,2015-09-23 00:00:00,4,3,Switzerland Super League,Switzerland

## Question 7: Get number of match by each league including league name, order the number of match by descending

In [8]:
# count the records after using group by statement with the `league_id` field
matches_per_league = pd.read_sql("select m.league_id, l.name, count(*) as number_of_matches "
                                 "from match as m, league as l "
                                 "where m.league_id = l.id "
                                 "group by m.league_id "
                                 "order by number_of_matches desc ", conn)

matches_per_league

    league_id                      name  number_of_matches
0       21518           Spain LIGA BBVA               3040
1        4769            France Ligue 1               3040
2        1729    England Premier League               3040
3       10257             Italy Serie A               3017
4       13274    Netherlands Eredivisie               2448
5        7809     Germany 1. Bundesliga               2448
6       17642  Portugal Liga ZON Sagres               2052
7       15722        Poland Ekstraklasa               1920
8       19694   Scotland Premier League               1824
9           1    Belgium Jupiler League               1728
10      24558  Switzerland Super League               1422

## Question 8: Get total goal of home team and away team in each league
- use Group By statement

In [9]:
# using group by statement with the `league_id` field
total_goals = pd.read_sql("""
    select m.league_id, l.name, sum(m.home_team_goal) as total_home_goals, sum(m.away_team_goal) as total_away_goals
    from match as m, league as l
    where m.league_id = l.id
    group by m.league_id
    order by total_home_goals desc, total_away_goals desc """, conn)

total_goals

    league_id                      name  total_home_goals  total_away_goals
0       21518           Spain LIGA BBVA              4959              3453
1        1729    England Premier League              4715              3525
2       10257             Italy Serie A              4528              3367
3       13274    Netherlands Eredivisie              4357              3185
4        4769            France Ligue 1              4265              3162
5        7809     Germany 1. Bundesliga              3982              3121
6       17642  Portugal Liga ZON Sagres              2890              2311
7           1    Belgium Jupiler League              2781              2060
8       15722        Poland Ekstraklasa              2678              1978
9       19694   Scotland Premier League              2607              2197
10      24558  Switzerland Super League              2365              1801

## Question 9: Select data from Team table

In [10]:
#write your query
teams = pd.read_sql("select * from team ", conn)
teams

        id  team_api_id  team_fifa_api_id      team_long_name team_short_name
0        1         9987             673.0            KRC Genk             GEN
1        2         9993             675.0        Beerschot AC             BAC
2        3        10000           15005.0    SV Zulte-Waregem             ZUL
3        4         9994            2007.0    Sporting Lokeren             LOK
4        5         9984            1750.0   KSV Cercle Brugge             CEB
..     ...          ...               ...                 ...             ...
294  49479        10190             898.0       FC St. Gallen             GAL
295  49837        10191            1715.0             FC Thun             THU
296  50201         9777             324.0         Servette FC             SER
297  50204         7730            1862.0  FC Lausanne-Sports             LAU
298  51606         7896               NaN              Lugano             LUG

[299 rows x 5 columns]

## Question 10: Get top 20 teams with highest home goal
- Use GROUP BY, LIMIT statement

In [11]:
# we need to group by `home_team_api_id` and then using limit query
top_team_home = pd.read_sql("select t.team_api_id, t.team_long_name, sum(m.home_team_goal) as total_home_goals "
                            "from match as m, team as t "
                            "where m.home_team_api_id = t.team_api_id "
                            "group by m.home_team_api_id "
                            "order by total_home_goals desc "
                            "limit 20 ", conn)
top_team_home

    team_api_id       team_long_name  total_home_goals
0          8633       Real Madrid CF               505
1          8634         FC Barcelona               495
2          9925               Celtic               389
3          9823     FC Bayern Munich               382
4          8640                  PSV               370
5          8456      Manchester City               365
6          8593                 Ajax               360
7          9931             FC Basel               344
8         10260    Manchester United               338
9          8455              Chelsea               333
10         9847  Paris Saint-Germain               332
11         9906      Atltico Madrid               321
12         9772           SL Benfica               321
13        10192       BSC Young Boys               319
14         9885             Juventus               307
15         9825              Arsenal               306
16         9875               Napoli               303
17        10267          Valencia CF               299
18         8686                 Roma               299
19         9789    Borussia Dortmund               298

## Question 11: Get top 20 teams with highest away goal
- Use GROUP BY, LIMIT statement

In [12]:
# we need to group by `away_team_api_id` and then using limit query
top_team_away = pd.read_sql("select t.team_api_id, t.team_long_name, sum(m.away_team_goal) as total_away_goals "
                            "from match as m, team as t "
                            "where m.away_team_api_id = t.team_api_id "
                            "group by m.away_team_api_id "
                            "order by total_away_goals desc "
                            "limit 20 ", conn)
top_team_away

    team_api_id       team_long_name  total_away_goals
0          8634         FC Barcelona               354
1          8633       Real Madrid CF               338
2          9925               Celtic               306
3          8593                 Ajax               287
4          8640                  PSV               282
5          9931             FC Basel               275
6          9823     FC Bayern Munich               271
7          9825              Arsenal               267
8          9789    Borussia Dortmund               253
9          8455              Chelsea               250
10         9772           SL Benfica               247
11         9773             FC Porto               246
12        10260    Manchester United               244
13         8456      Manchester City               241
14         8650            Liverpool               237
15         9885             Juventus               236
16         9847  Paris Saint-Germain               236
17         8686                 Roma               231
18        10243            FC Zrich               227
19         8586    Tottenham Hotspur               226

## Question 12: Get team long name with total of goal, order the total number by descending

- Total of goal of a team is added up from both away and home games
- Use UNION statement

In [13]:
# the total goals of each team = total home goals + total away goals
team_total_goals = pd.read_sql("select m.team_api_id, t.team_long_name, sum(m.total_goal) as total_goal "
                               "from (select home_team_api_id as team_api_id, sum(home_team_goal) as total_goal "
                               "from match group by home_team_api_id "
                               "union all "
                               "select away_team_api_id as team_api_id, sum(away_team_goal) as total_goal "
                               "from match group by away_team_api_id) as m, team as t "
                               "where m.team_api_id = t.team_api_id "
                               "group by m.team_api_id "
                               "order by total_goal desc ", conn)
team_total_goals

     team_api_id        team_long_name  total_goal
0           8634          FC Barcelona         849
1           8633        Real Madrid CF         843
2           9925                Celtic         695
3           9823      FC Bayern Munich         653
4           8640                   PSV         652
..           ...                   ...         ...
294         8357  SpVgg Greuther Frth          26
295         7992              Trofense          25
296         6631          FC Dordrecht          24
297         7869            Crdoba CF          22
298       108893      AC Arles-Avignon          21

[299 rows x 3 columns]

## Question 13: Get team long name with total of matches, order the total number by descending

In [14]:
# the total matches of each team = total home matches + total away matches
team_total_matches = pd.read_sql("select m.team_api_id, t.team_long_name, sum(m.number_of_matches) as total_matches "
                               "from (select home_team_api_id as team_api_id, count(*) as number_of_matches "
                               "from match group by home_team_api_id "
                               "union all "
                               "select away_team_api_id as team_api_id, count(*) as number_of_matches "
                               "from match group by away_team_api_id) as m, team as t "
                               "where m.team_api_id = t.team_api_id "
                               "group by m.team_api_id "
                               "order by total_matches desc ", conn)
team_total_matches

     team_api_id     team_long_name  total_matches
0          10267        Valencia CF            304
1          10260  Manchester United            304
2          10252        Aston Villa            304
3          10194         Stoke City            304
4           9941        Toulouse FC            304
..           ...                ...            ...
294        10213            Amadora             30
295         9765       Portimonense             30
296         7992           Trofense             30
297         6351          KAS Eupen             30
298         4064           Feirense             30

[299 rows x 3 columns]

## Question 14: Get numbers of win, lost and draw matches of each team

- If a team has home goal > away goal , team is win in this match
- If a team has home goal < away goal , team is lost in this match
- If a team has home goal = away goal , team is draw in this match
- Use Case When statement

In [15]:
# we need to calculate the win, draw and lose matches of each team in both home and away side.
team_with_results = pd.read_sql("""select m.team_id, t.team_long_name, sum(win) as win, sum(draw) as draw, sum(lose) as lose
from (select home_team_api_id as team_id, sum(home_win) as win, sum(draw) as draw, sum(home_lose) as lose
      from (select home_team_api_id,
                   case when home_team_goal > away_team_goal then 1 else 0 end as home_win,
                   case when home_team_goal = away_team_goal then 1 else 0 end as draw,
                   case when home_team_goal < away_team_goal then 1 else 0 end as home_lose
            from Match)
      group by home_team_api_id
      union all
      select away_team_api_id as team_id, sum(away_win) as win, sum(draw) as draw, sum(away_lose) as lose
      from (select away_team_api_id,
                   case when home_team_goal > away_team_goal then 1 else 0 end as away_lose,
                   case when home_team_goal = away_team_goal then 1 else 0 end as draw,
                   case when home_team_goal < away_team_goal then 1 else 0 end as away_win
            from Match)
      group by away_team_api_id) as m, Team as t
where m.team_id = t.team_api_id
group by m.team_id
order by win desc, draw desc, lose""", conn)
team_with_results

     team_id         team_long_name  win  draw  lose
0       8634           FC Barcelona  234    43    27
1       8633         Real Madrid CF  228    36    40
2       9925                 Celtic  218    50    36
3       9823       FC Bayern Munich  193    44    35
4      10260      Manchester United  192    57    55
..       ...                    ...  ...   ...   ...
294     9912  DSC Arminia Bielefeld    4    16    14
295     8357   SpVgg Greuther Frth    4     9    21
296     6631           FC Dordrecht    4     8    22
297     7869             Crdoba CF    3    11    24
298   108893       AC Arles-Avignon    3    11    24

[299 rows x 5 columns]

## Question 15: Get top 10 team with highest numbers of win matches

In [16]:
# using the above query and insert the limit statement
top_10_team = pd.read_sql("""select m.team_id, t.team_long_name, sum(win) as win, sum(draw) as draw, sum(lose) as lose
from (select home_team_api_id as team_id, sum(home_win) as win, sum(draw) as draw, sum(home_lose) as lose
      from (select home_team_api_id,
                   case when home_team_goal > away_team_goal then 1 else 0 end as home_win,
                   case when home_team_goal = away_team_goal then 1 else 0 end as draw,
                   case when home_team_goal < away_team_goal then 1 else 0 end as home_lose
            from Match)
      group by home_team_api_id
      union all
      select away_team_api_id as team_id, sum(away_win) as win, sum(draw) as draw, sum(away_lose) as lose
      from (select away_team_api_id,
                   case when home_team_goal > away_team_goal then 1 else 0 end as away_lose,
                   case when home_team_goal = away_team_goal then 1 else 0 end as draw,
                   case when home_team_goal < away_team_goal then 1 else 0 end as away_win
            from Match)
      group by away_team_api_id) as m, Team as t
where m.team_id = t.team_api_id
group by m.team_id
order by win desc, draw desc, lose
limit 10""", conn)

top_10_team

   team_id     team_long_name  win  draw  lose
0     8634       FC Barcelona  234    43    27
1     8633     Real Madrid CF  228    36    40
2     9925             Celtic  218    50    36
3     9823   FC Bayern Munich  193    44    35
4    10260  Manchester United  192    57    55
5     9885           Juventus  189    66    46
6     9772         SL Benfica  185    36    27
7     9773           FC Porto  183    42    23
8     8593               Ajax  181    59    32
9     9931           FC Basel  180    64    42

## Question 16: Get percentage of each league to join the matches

In [17]:
# using group by on `league_id` and then using cross join and inner join to merge the missing info
percentage_of_each_league = pd.read_sql("""
select m.league_id, l.name, round(m.match_of_each_league * 100.0/t.total_match, 2) as percentage_of_match
from (select league_id, count(*) as match_of_each_league
      from Match
      group by league_id) as m
    cross join (select count(*) as total_match from Match) as t
    inner join League as l on m.league_id = l.id
order by percentage_of_match desc""", conn)

percentage_of_each_league

    league_id                      name  percentage_of_match
0        1729    England Premier League                11.70
1        4769            France Ligue 1                11.70
2       21518           Spain LIGA BBVA                11.70
3       10257             Italy Serie A                11.61
4        7809     Germany 1. Bundesliga                 9.42
5       13274    Netherlands Eredivisie                 9.42
6       17642  Portugal Liga ZON Sagres                 7.90
7       15722        Poland Ekstraklasa                 7.39
8       19694   Scotland Premier League                 7.02
9           1    Belgium Jupiler League                 6.65
10      24558  Switzerland Super League                 5.47

## Question 17: Get percentage of score in each league

In [18]:
# do the same process as above, but this time we need to sum both home goals and away goals
percentage_score_each_league = pd.read_sql("""
select m.league_id, l.name, round(m.total_of_each_league * 100.0/t.total, 2) as percentage_of_goal
from (select league_id, sum(home_team_goal + away_team_goal) as total_of_each_league
      from Match
      group by league_id) as m
    cross join (select sum(home_team_goal + away_team_goal) as total from Match) as t
    inner join League as l on m.league_id = l.id
order by percentage_of_goal desc""", conn)

percentage_score_each_league

    league_id                      name  percentage_of_goal
0       21518           Spain LIGA BBVA               11.97
1        1729    England Premier League               11.72
2       10257             Italy Serie A               11.23
3       13274    Netherlands Eredivisie               10.73
4        4769            France Ligue 1               10.57
5        7809     Germany 1. Bundesliga               10.11
6       17642  Portugal Liga ZON Sagres                7.40
7           1    Belgium Jupiler League                6.89
8       19694   Scotland Premier League                6.83
9       15722        Poland Ekstraklasa                6.62
10      24558  Switzerland Super League                5.93

## Question 18: Get total numbers of goals for each league in each season

In [19]:
# using group by statement on two fields `league_id` and `season`
goal_by_league_and_season = pd.read_sql("""
select m.league_id, l.name, m.season, sum(m.home_team_goal + m.away_team_goal) as goals_of_season
from Match as m, League as l
where m.league_id = l.id
group by m.league_id, m.season
""", conn)

goal_by_league_and_season

    league_id                      name     season  goals_of_season
0           1    Belgium Jupiler League  2008/2009              855
1           1    Belgium Jupiler League  2009/2010              565
2           1    Belgium Jupiler League  2010/2011              635
3           1    Belgium Jupiler League  2011/2012              691
4           1    Belgium Jupiler League  2012/2013              703
..        ...                       ...        ...              ...
83      24558  Switzerland Super League  2011/2012              425
84      24558  Switzerland Super League  2012/2013              462
85      24558  Switzerland Super League  2013/2014              520
86      24558  Switzerland Super League  2014/2015              517
87      24558  Switzerland Super League  2015/2016              566

[88 rows x 4 columns]

## Question 19: Get player attributes

- Convert weight to kilogram
- Convert height to meter
- Calculuate bmi = ( (weight* 0.453592) / (height/100)^2)
- Get Age of player

In [20]:
# using strftime() to calculate the age of player
player_attrs = pd.read_sql("""
select player_api_id, player_name,
       round(weight*0.453592, 2) as weight_in_kg,
       round(height/100, 2) as height_in_m,
       round((weight*0.453592) / ((height/100)*(height/100)), 2) as BMI,
       strftime('%Y', 'now') - strftime('%Y', birthday) - (strftime('%m-%d', 'now') < strftime('%m-%d', birthday)) AS age
from Player
""", conn)

player_attrs

,player_api_id,player_name,weight_in_kg,height_in_m,BMI,age
0,505942,Aaron Appindangoye,84.82,1.83,25.36,31
1,155782,Aaron Cresswell,66.22,1.70,22.87,33
2,162549,Aaron Doran,73.94,1.70,25.53,32
3,30572,Aaron Galindo,89.81,1.83,26.85,41
4,23780,Aaron Hughes,69.85,1.83,20.89,43
...,...,...,...,...,...,...
11055,26357,Zoumana Camara,76.20,1.83,22.78,44
11056,111182,Zsolt Laczko,79.83,1.83,23.87,36
11057,36491,Zsolt Low,69.85,1.80,21.48,44
11058,35506,Zurab Khizanishvili,78.02,1.85,22.69,41
11059,39902,Zvjezdan Misimovic,79.83,1.80,24.55,41

## Question 20: Get oldest player

In [21]:
# based on the result of the above query, we order the age and then get the first one
oldest_age = pd.read_sql("""
select player_api_id, player_name, max(age) as age
from (select player_api_id,
             player_name,
             strftime('%Y', 'now') - strftime('%Y', birthday) -
             (strftime('%m-%d', 'now') < strftime('%m-%d', birthday)) AS age
      from Player)
""", conn)

oldest_age

   player_api_id      player_name  age
0          39425  Alberto Fontana   56

## Question 21: Get players who played highest number of matches

In [22]:
# using join statement to join each player id with the match that they play and then do the counting
players_with_highest_matches = pd.read_sql("""
SELECT p.player_api_id, p.player_name, COUNT(*) AS matches_played
FROM Player p
JOIN Match m ON p.player_api_id IN (
        m.home_player_1, m.home_player_2, m.home_player_3, m.home_player_4, m.home_player_5, m.home_player_6,
        m.home_player_7, m.home_player_8, m.home_player_9, m.home_player_10, m.home_player_11,
        m.away_player_1, m.away_player_2, m.away_player_3, m.away_player_4, m.away_player_5, m.away_player_6,
        m.away_player_7, m.away_player_8, m.away_player_9, m.away_player_10, m.away_player_11
    )
GROUP BY p.player_api_id, p.player_name
ORDER BY matches_played DESC
""", conn)

players_with_highest_matches.iloc[0]

player_api_id              31293
player_name       Steve Mandanda
matches_played               300
Name: 0, dtype: object

## Question 22: Get players who had overall_rating larger than 80

In [23]:
# count the player's rating by divide the `overall_rating` by count(*). Then, do the filtering and sorting.
players_with_rating = pd.read_sql("""
select r.player_api_id, p.player_name, r.rating
from
(select player_api_id, sum(overall_rating)/ count(*) as rating
from Player_Attributes
group by player_api_id
order by rating) as r, Player as p
where r.player_api_id = p.player_api_id and rating > 80
""", conn)
players_with_rating

     player_api_id         player_name  rating
0            21446            Hernanes      81
1            22984        Ivan Cordoba      81
2            24011        Mikel Arteta      81
3            24154          Ryan Giggs      81
4            24846     Leighton Baines      81
..             ...                 ...     ...
141          30924       Franck Ribery      88
142          30955      Andres Iniesta      88
143          35724  Zlatan Ibrahimovic      88
144          30893   Cristiano Ronaldo      91
145          30981        Lionel Messi      92

[146 rows x 3 columns]